Repository: dotnet/command-line-api
Catalog: src/System.CommandLine/Properties/xlf/Resources.*.xlf
Languages: es, fi, fr

# ArgumentConversionCannotParse
source: Cannot parse argument '{0}' as expected type '{1}'.
es: No se pudo analizar el argumento '{0}' como el tipo esperado '{1}'.
fi: Argumenttia '{0}' ei voi jäsentää odotetuksi tyypiksi '{1}'.
fr: Impossible d'interpréter l'argument '{0}' en tant que type attendu '{1}'.

# ArgumentConversionCannotParseForCommand
source: Cannot parse argument '{0}' for command '{1}' as expected type '{2}'.
es: No se pudo analizar el argumento '{0}' para el comando '{1}' como el tipo esperado '{2}'.
fi: Komennon '{1}' argumenttia '{0}' ei voi jäsentää odotetuksi tyypiksi '{2}'.
fr: Impossible d'interpréter l'argument '{0}' pour la commande '{1}' en tant que type attendu '{2}'.

# ArgumentConversionCannotParseForCommand_Completions
source: Cannot parse argument '{0}' for command '{1}' as expected type '{2}'. Did you mean one of the following?{3}
fi: Komennon '{1}' argumenttia '{0}' ei voi jäsentää odotetuksi tyypiksi '{2}'. Tarkoititko jotakin seuraavista?{3}
fr: Impossible d'interpréter l'argument '{0}' pour la commande '{1}' en tant que type attendu '{2}'. Vouliez-vous dire l'un des éléments suivants ?{3}

# ArgumentConversionCannotParseForOption
source: Cannot parse argument '{0}' for option '{1}' as expected type '{2}'.
es: No se pudo analizar el argumento '{0}' para la opción '{1}' como el tipo esperado '{2}'.
fi: Valitsimen '{1}' argumenttia '{0}' ei voi jäsentää odotetuksi tyypiksi '{2}'.
fr: Impossible d'interpréter l'argument '{0}' pour l'option '{1}' en tant que type attendu '{2}'.

# ArgumentConversionCannotParseForOption_Completions
source: Cannot parse argument '{0}' for option '{1}' as expected type '{2}'. Did you mean one of the following?{3}
fi: Valitsimen '{1}' argumenttia '{0}' ei voi jäsentää odotetuksi tyypiksi '{2}'. Tarkoititko jotakin seuraavista?{3}
fr: Impossible d'interpréter l'argument '{0}' pour l'option '{1}' en tant que type attendu '{2}'. Vouliez-vous dire l'un des éléments suivants ?{3}

# CommandRequiredArgumentMissing
source: Required argument missing for command: '{0}'.
es: Falta el argumento requerido para el comando: '{0}'.
fi: Pakollinen argumentti puuttuu komennolta: '{0}'.
fr: Argument obligatoire manquant pour la commande : '{0}'.

# DirectoryDoesNotExist
source: Directory does not exist: '{0}'.
es: El directorio no existe: '{0}'.
fi: Hakemistoa ei ole olemassa: '{0}'.
fr: Le répertoire n'existe pas : '{0}'.

# ErrorReadingResponseFile
source: Error reading response file '{0}': {1}
es: Error al leer el archivo de respuesta '{0}': {1}
fi: Virhe lukiessa vastaustiedostoa '{0}': {1}
fr: Erreur durant la lecture du fichier réponse '{0}' : {1}

# ExceptionHandlerHeader
source: Unhandled exception:
es: Excepción no interceptada:
fi: Käsittelemätön poikkeus:
fr: Exception non gérée :

# FileDoesNotExist
source: File does not exist: '{0}'.
es: El archivo no existe: '{0}'.
fi: Tiedostoa ei ole olemassa: '{0}'.
fr: Le fichier n'existe pas : '{0}'.

# FileOrDirectoryDoesNotExist
source: File or directory does not exist: '{0}'.
es: El archivo o el directorio no existe: '{0}'.
fi: Tiedostoa tai hakemistoa ei ole olemassa: '{0}'.
fr: Le fichier ou le répertoire n'existe pas : '{0}'.

# HelpAdditionalArgumentsDescription
source: Arguments passed to the application that is being run.
es: Los argumentos pasaron a la aplicación que se está ejecutando.
fi: Argumentit, jotka välitetään suoritettavalle sovellukselle.
fr: Arguments transmis à l'application en cours d'exécution.

# HelpAdditionalArgumentsTitle
source: Additional Arguments:
es: Argumentos adicionales:
fi: Lisäargumentit:
fr: Arguments supplémentaires :

# HelpArgumentDefaultValueLabel
source: default
es: por defecto
fi: oletus
fr: par défaut

# HelpArgumentsTitle
source: Arguments:
es: Argumentos:
fi: Argumentit:

# HelpCommandsTitle
source: Commands:
es: Comandos:
fi: Komennot:
fr: Commandes :

# HelpDescriptionTitle
source: Description:
es: Descripción:
fi: Kuvaus:

# HelpOptionDescription
source: Show help and usage information
es: Mostrar ayuda e información de uso
fi: Näytä ohje- ja käyttötiedot
fr: Afficher l'aide et les informations d'utilisation

# HelpOptionsRequiredLabel
source: (REQUIRED)
es: (REQUERIDO)
fi: (PAKOLLINEN)
fr: (REQUIS)

# HelpOptionsTitle
source: Options:
es: Opciones:
fi: Valitsimet:

# HelpUsageAdditionalArguments
source: [[--] <additional arguments>...]]
fi: [[--] <lisäargumentit>...]]
fr: [[--] <arguments supplémentaires>...]]

# HelpUsageCommand
source: [command]
es: [comando]
fi: [komento]
fr: [commande]

# HelpUsageOptions
source: [options]
es: [opciones]
fi: [valitsimet]

# HelpUsageTitle
source: Usage:
es: Uso:
fi: Käyttö:
fr: Utilisation :

# InvalidCharactersInFileName
source: Character not allowed in a file name: '{0}'.
es: Carácter no permitido en un nombre de archivo: '{0}'.
fi: Merkki ei ole sallittu tiedostonimessä: '{0}'.
fr: Caractère non autorisé dans un nom de fichier : '{0}'.

# InvalidCharactersInPath
source: Character not allowed in a path: '{0}'.
es: Carácter no permitido en una ruta: '{0}'.
fi: Merkki ei ole sallittu polussa: '{0}'.
fr: Caractère non autorisé dans un chemin : '{0}'.

# OptionExpectsOneArgument
source: Option '{0}' expects a single argument but {1} were provided.
es: La opción '{0}' espera un solo argumento, pero se proporcionaron {1}.
fi: Valitsin '{0}' odottaa yhtä argumenttia, mutta {1} annettiin.
fr: L'option '{0}' attend un seul argument, mais {1} ont été fournis.

# OptionRequiredArgumentMissing
source: Required argument missing for option: '{0}'.
es: Falta el argumento requerido para la opción: '{0}'.
fi: Pakollinen argumentti puuttuu valitsimelta: '{0}'.
fr: Argument obligatoire manquant pour l'option : '{0}'.

source: Required command was not provided.
es: No se proporcionó el comando requerido.
fi: Pakollista komentoa ei annettu.
fr: La commande nécessaire n'a pas été fournie.

# RequiredOptionWasNotProvided
source: Option '{0}' is required.
es: Se requiere la opción '{0}'.
fi: Valitsin '{0}' on pakollinen.
fr: L'option '{0}' est requise.

# ResponseFileNotFound
source: Response file not found '{0}'.
es: Archivo de respuesta '{0}' no encontrado.
fi: Vastaustiedostoa ei löytynyt '{0}'.
fr: Fichier réponse introuvable '{0}'.

# SuggestionsTokenNotMatched
source: '{0}' was not matched. Did you mean one of the following?
es: '{0}' no se encontró.¿Quiso decir uno de los siguientes?
fi: '{0}' ei täsmännyt. Tarkoititko jotakin seuraavista?
fr: '{0}' ne correspond à rien. Vouliez-vous dire l'un des éléments suivants ?

# UnrecognizedArgument
source: Argument '{0}' not recognized. Must be one of:{1}
es: Argumento '{0}' no reconocido. Debe ser uno de: {1}
fi: Argumenttia '{0}' ei tunnistettu. Sen täytyy olla jokin seuraavista:{1}
fr: Argument '{0}' non reconnu. Il doit faire partie de : {1}

# UnrecognizedCommandOrArgument
source: Unrecognized command or argument '{0}'.
es: Comando o argumento no reconocido '{0}'.
fi: Tunnistamaton komento tai argumentti '{0}'.
fr: Commande ou argument non reconnu : '{0}'.

# VersionOptionCannotBeCombinedWithOtherArguments
source: {0} option cannot be combined with other arguments.
es: La opción {0} no se puede combinar con otros argumentos.
fi: Valitsinta {0} ei voi yhdistää muihin argumentteihin.
fr: L'option {0} ne peut pas être combinée avec d'autres arguments.

# VersionOptionDescription
source: Show version information
es: Mostrar información de la versión
fi: Näytä versiotiedot
fr: Afficher les informations de version
